Revit 2026 API

# ValidationStatus Enumeration

---

Lists the validation type of the fabrication part.

**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ValidationStatus
```
```vb
Public Enumeration ValidationStatus
```
```cpp
public enum class ValidationStatus
```
```fsharp
type ValidationStatus
```

| Member name | Value | Description |
| --- | --- | --- |
| InvalidDimensions | 1 | The part has invalid dimensions. |
| NoMaterial | 2 | The part has no material being specified. |
| Valid | 0 | The part is valid to fabrication. |

#### Reference

Autodesk.Revit.DB.Fabrication Namespace